package com.example.aisuangua.myUtils.zhouyi;

public class Shierjian {
    /**
     * 通勝十二建判断可以做什么不可以做什么
     *
     * @param shierjianString 通勝十二建字符串
     */
    public String cando="";
    public String canotdo="";;
    /**
     * 月支日支	一月寅节	二月卯节	三月辰节	四月巳节	五月午节	六月未节	七月申节	八月酉节	九月戍节	十月亥节	十一子节	十二丑节 子	开	收	成
     * 危	破	执	定	平	满	除	建	闭 丑	闭	开	收	成	危	破	执	定	平	满	除	建 寅	建	闭	开	收	成	危	破	执	定	平	满	除 卯	除
     * 建	闭	开	收	成	危	破	执	定	平	满 辰	满	除	建	闭	开	收	成	危	破	执	定	平 巳	平	满	除	建	闭	开	收	成	危	破	执	定
     * 午	定	平	满	除	建	闭	开	收	成	危	破	执 未	执	定	平	满	除	建	闭	开	收	成	危	破 申	破	执	定	平	满	除	建	闭	开	收
     * 成	危 酉	危	破	执	定	平	满	除	建	闭	开	收	成 戍	成	危	破	执	定	平	满	除	建	闭	开	收 亥	收	成	危	破	执	定	平	满
     * 除	建	闭	开
     *
     *
     */
    String[][] data = {{"开", "收", "成", "危", "破", "执", "定", "平", "满", "除", "建", "闭"},
            {"闭", "开", "收", "成", "危", "破", "执", "定", "平", "满", "除", "建"},
            {"建", "闭", "开", "收", "成", "危", "破", "执", "定", "平", "满", "除"},
            {"除", "建", "闭", "开", "收", "成", "危", "破", "执", "定", "平", "满"},
            {"满", "除", "建", "闭", "开", "收", "成", "危", "破", "执", "定", "平"},
            {"平", "满", "除", "建", "闭", "开", "收", "成", "危", "破", "执", "定"},
            {"定", "平", "满", "除", "建", "闭", "开", "收", "成", "危", "破", "执"},
            {"执", "定", "平", "满", "除", "建", "闭", "开", "收", "成", "危", "破"},
            {"破", "执", "定", "平", "满", "除", "建", "闭", "开", "收", "成", "危"},
            {"危", "破", "执", "定", "平", "满", "除", "建", "闭", "开", "收", "成"},
            {"成", "危", "破", "执", "定", "平", "满", "除", "建", "闭", "开", "收"},
            {"收", "成", "危", "破", "执", "定", "平", "满", "除", "建", "闭", "开"},};
    String[] shengxiao = {"子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戍", "亥"};

    public String getshierjian(int mouth, String rizhi) {
        if (mouth < 1 || mouth > 12) {
            return null;
        }
        int riziindex = getarrayindex(shengxiao, rizhi);
        return data[riziindex][mouth - 1];
    }

    public int getarrayindex(String[] array, String target) {
        for (int i = 0; i < array.length; i++) {
            if (array[i].equals(target)) {
                return i;
            }
        }
        return -1;
    }
}
